/*************************************************************************
	> File Name: 8.HZOJ-113.c
	> Author: 
	> Mail: 
	> Created Time: 2024年03月27日 星期三 14时50分17秒
 ************************************************************************/

#include<stdio.h>
int main() {
    
    int y, m, a;
    scanf("%d%d", &y, &m);
    a = (y % 4 == 0 && y % 100) || y % 400 == 0;
    //&&运算都真才真，y%100的值不影响条件表达式的值
    if (m == 1 || m == 3 || m == 5 || m == 7
        ||  m == 8 || m == 8 || m == 10 || m == 12) {
        printf("31\n");
    }else if(m == 4 || m == 6 || m == 9 || m == 11) {
         printf("30\n");
    }else{
        printf("%d\n", 28 + a);
    }



    return 0;
}
