/*************************************************************************
	> File Name: 2.stdout.c
	> Author: 
	> Mail: 
	> Created Time: 2024年04月07日 星期日 08时52分54秒
 ************************************************************************/

#include<stdio.h>

int main() {
    
    //printf("dsafasfgscv23154123");
    //*((int *)(0)) = 5;
    //printf先进输出缓冲区还没来得及输出到终端就崩溃了

    //printf("dsafasfgscv23154123\n");
    //*((int *)(0)) = 5;
    //有换行符，输出到终端后的下一行才崩溃

    printf("dsafasfgscv23154123");
    fflush(stdout);//冲刷输出缓冲区时可将其冲刷到终端
    *((int *)(0)) = 5;
    

    return 0;
}
